#alt-tab
#iterm2
betterdisplay
coconutbattery
cursor
dozer
font-symbols-only-nerd-font
fuse-t
fuse-t-sshfs
ghostty
gpg-suite-no-mail
grandperspective
imagej
inkscape
#jan
lm-studio
#mitmproxy
nextcloud-vfs
omnidisksweeper
#openscad
prusaslicer
raycast
stats
#topit
utm
whisky
wireshark
wireshark-app
#wkhtmltopdf
xbar
